NextFOAM-2409/tutorials/combustion/fireFoam/LES/smallPoolFire3D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication topoSet

runApplication createPatch -overwrite

runApplication decomposePar -force

runParallel $(getApplication)

#------------------------------------------------------------------------------
